{
  "url": "https://jobright.ai/jobs/info/6964d0e02cbf4e44756e4c8c",
  "title": "Software Engineer - Full Stack Developer",
  "company": "",
  "description": "Jobs\nResume\nProfile\nAgent\nTurbo for Students: Get Hired Faster!\nJOBS\nRecommended\nLiked\n0\nApplied\n172\nExternal\n1\n68 applicants\nAPPLY WITH AUTOFILL\nOverview\nCompany\nShare\nReport Issue\nOriginal Job Post\nHibu\n· 15 minutes ago\nSoftware Engineer - Full Stack Developer\nKing of Prussia, Pennsylvania, United States\nFull-time\nHybrid\nEntry, Mid Level\n2+ years exp\n54%\nFAIR MATCH\n100%\nExp. Level\n20%\nSkill\n67%\nIndustry Exp.\nMaximize your interview chances\nGenerate Custom Resume Hibu is seeking a Full Stack Developer with a passion for building modern web applications and an interest in AI-driven development. The role involves designing, developing, testing, and maintaining applications on Hibu’s product platform, with a focus on integrating AI features and emerging technologies. Consulting\nDigital Marketing\nMarketing\nGrowth Opportunities\nH1B Sponsor Likely\nInsider Connection @Hibu\n5 email credits available today\nDiscover valuable connections within the company who might provide insights and potential referrals.\nGet 3x more responses when you reach out via email instead of LinkedIn.\nBeyond Your Network\nFind More Connections\nFrom Your Previous Company\nFind More Connections\nFrom Your School\nFind More Connections\nFind Any Email\nResponsibilities\nDesign, develop. test, and deploy responsive web applications\nCollaborate with team members to integrate AI-driven features\nWrite clean, secure, and maintainable code\nTroubleshoot and resolve issues across application tiers\nStay current with emerging technologies and AI development practices\nQualification\nRepresents the skills you have Find out how your skills align with this job's requirements. If anything seems off, you can easily click on the tags to select or unselect skills to reflect your actual expertise. Full Stack Development\nAI Development\nMicroservices\nReact\nNode.js\nAWS Services\nCI/CD Practices\nAgile Collaboration\nVersion Control (Git)\nProblem-Solving\nCommunication\nRequired\nBachelor's degree in Computer Science or related field (or equivalent experience)\n2–4 years of web development experience (or strong project/internship experience)\nHands-on experience or strong interest in AI development, including AI coding and prompt engineering\nWorking with AI-assisted development tools (e.g., Cursor AI editor)\nUnderstanding how to integrate AI features into applications\n2-4 years of experience with front-end technologies: React, Angular (or similar), TypeScript, JavaScript, CSS\n2-4 years of experience with back-end technologies: Node.js, Express, Python, Java (Spring Boot preferred)\nBasic knowledge of databases: Relational (Postgres) and/or NoSQL (MongoDB)\n2-4 years Exposure to AWS services, such as: API Gateway (for managing APIs), Lambda (serverless functions), SQS/SNS (messaging and notifications), CloudWatch (monitoring and logging), CloudFormation (infrastructure as code), S3 (object storage)\nUnderstanding of object-oriented programming principles\nFamiliarity with version control (Git)\nExperience with working collaboratively on Agile teams\nPreferred\nExperience with Cursor AI editor or similar AI-assisted coding tools\nKnowledge of microservices best practices\nFamiliarity with CI/CD practices using CircleCI and LaunchDarkly flagging (or equivalent)\nStrong communication and problem-solving skills\nBenefits\nCompetitive compensation\nOngoing training\nIncentives\nGenerous benefits package\nCompany\nHibu\nGlassdoor\n4.0\nHibu Inc. provides digital marketing solutions to local businesses.\nFounded in 2012\nCedar Rapids, Iowa, USA\n1001-5000 employees\nhttps://hibu.com/\nH1B Sponsorship\nHibu has a track record of offering H1B sponsorships. Please note that this does not guarantee sponsorship for this specific role. Below presents additional info for your reference. (Data Powered by US Department of Labor)\nDistribution of Different Job Fields Receiving Sponsorship\nRepresents job field similar to this job\nTrends of Total Sponsorships\n2024 (1)\n2023 (1)\n2022 (1)\n2021 (2)\n2020 (3)\nFunding\nCurrent Stage\nLate Stage\nTotal Funding\nunknown\n2021-03-26\nAcquired\nLeadership Team\nRob Hall\nChief Financial Officer\nRecent News\nEIN Presswire\nLOUD Collective Names Ben Dean as Chief Technology Officer\n2025-10-07\nCorridor Business Journal\nHibu named to Selling Power’s 2025 list of ‘60 Best Companies to Sell For’\n2025-07-26\nThe Secrets of Entrepreneurship\nHibu Reviews from Business Owners Who Tried Everything Else First\n2025-07-24\nCompany data provided by crunchbase Orion Your AI Copilot Quick Guide Welcome back, Nuthanreddy Vaddireddy!\nIt's great to see you again. Let's resume your journey towards your dream job. I see that you're asking about this Software Engineer - Full Stack Developer role at Hibu. What would you like to know? Tell me why this job is a good fit for me.\nGive me some resume tips if I want to apply.\nGenerate custom resume tailored to this job.\nWrite a cover letter for this job.",
  "location": "Unknown",
  "posted_date": null,
  "source": "jobright",
  "posted_at": "15 minutes ago",
  "apply_url": "https://jobright.ai/jobs/info/6964d0e02cbf4e44756e4c8c",
  "id": "",
  "is_valid": true,
  "rejection_reason": null,
  "technical_skills": [],
  "soft_skills": [],
  "keywords": [],
  "resume_path": null,
  "cover_letter_path": null,
  "score": 0,
  "feedback": ""
}