{
  "url": "https://jobright.ai/jobs/info/68561f2ddb9b2a749af54201",
  "title": "Research Data Scientist",
  "company": "",
  "description": "Jobs\nResume\nProfile\nAgent\nTurbo for Students: Get Hired Faster!\nJOBS\nRecommended\nLiked\n0\nApplied\n172\nExternal\n1\n49 applicants\nAPPLY WITH AUTOFILL\nOverview\nCompany\nShare\nReport Issue\nOriginal Job Post\nTatari\n· 1 hour ago\nResearch Data Scientist\nSan Francisco, California, United States\nFull-time\nHybrid\nMid Level\n$130K/yr - $160K/yr\n94%\nSTRONG MATCH\n78%\nExp. Level\n100%\nSkill\n76%\nIndustry Exp.\nMaximize your interview chances\nGenerate Custom Resume Tatari is on a mission to revolutionize TV advertising, working with various disruptor brands to enhance their business through innovative media solutions. The Research Data Scientist will collaborate with engineering teams to build predictive models and analyze data to optimize business strategies and redefine marketing analytics for TV and streaming media. Advertising\nAnalytics\nInternet\nMedia and Entertainment\nSoftware\nTV\nGrowth Opportunities\nH1B Sponsor Likely\nInsider Connection @Tatari\n5 email credits available today\nDiscover valuable connections within the company who might provide insights and potential referrals.\nGet 3x more responses when you reach out via email instead of LinkedIn.\nBeyond Your Network\nView\nT\nL\nZ\nM\nM\nThomas Hogan & 4 connections\nFrom Your Previous Company\nFind More Connections\nFrom Your School\nFind More Connections\nFind Any Email\nResponsibilities\nCollaborating closely with our engineering and technology teams, the Data Scientist will build predictive models, measurement algorithms, and deep analyses to provide insights for optimizing our business\nApplying fluent understanding of state-of-the-art machine learning techniques to build predictive models and recommender systems\nApplying deep understanding of statistics and probability to devise improvements to existing algorithms\nContributing to developing and maintaining internal analysis software libraries\nDeveloping new intellectual property\nAnalyzing large amounts of data to identify relationships and trends, translating them into actionable insights for our product team and clients\nReporting findings, both orally and in writing\nQualification\nRepresents the skills you have Find out how your skills align with this job's requirements. If anything seems off, you can easily click on the tags to select or unselect skills to reflect your actual expertise. Machine Learning\nStatistics\nData Manipulation\nPython\nSQL\nProject Management\nCommunication Skills\nCreativity\nRequired\nMasters' degree in a technical field (e.g., Computer Science, Mathematics, Physics, Data Science, etc.)\nAdvanced experience in data manipulation tools (e.g., Python, pandas, pyspark, SQL)\nDeep knowledge of statistics, probability, and machine learning techniques\nExperience building/testing/validating ML models using state-of-the-art tech\nStrong background designing and developing software to implement advanced analytic algorithms\nA quick learner, with the ability to work independently and adaptably in a fast-paced environment\nStrengths in creativity & open-ended problem-solving-- able to identify what's important (and not important) to focus on in order to construct effective approaches to challenging problems\nStrong strategic thinking capabilities and project management skills\nStrong communication skills, both written and oral\nPreferred\nPhD in a technical field\nIndustry experience with development and deployment of predictive models or recommendation systems\nBenefits\nEquity compensation\nHealth insurance coverage for you and your dependents\n401K, FSA, and commuter benefits\n$150 monthly spending account\n$1,000 annual continued education benefit\n$500 WFH reimbursement\nUnlimited PTO and sick days\nMonthly Company Wellness Day Off\nSnacks, drinks, and catered lunches at the office\nTeam building events\nHybrid RTO of 2 days per week. THIS IS AN IN-OFFICE POSITION\nCompany\nTatari\nGlassdoor\n4.3\nTatari is a data & analytics company focused on buying and measuring advertising across linear and streaming TV.\nFounded in 2016\nSan Francisco, California, USA\n51-200 employees\nhttps://www.tatari.tv/\nH1B Sponsorship\nTatari has a track record of offering H1B sponsorships. Please note that this does not guarantee sponsorship for this specific role. Below presents additional info for your reference. (Data Powered by US Department of Labor)\nDistribution of Different Job Fields Receiving Sponsorship\nRepresents job field similar to this job\nTrends of Total Sponsorships\n2025 (2)\n2024 (3)\n2023 (3)\n2021 (3)\n2020 (2)\nFunding\nCurrent Stage\nGrowth Stage\nTotal Funding\nunknown\n2019-01-01\nSeries Unknown\n2016-11-26\nConvertible Note\nLeadership Team\nMike Swinson\nCo-Founder and Chief Data Scientist\nAmit Sharan\nSVP of Marketing\nRecent News\nMedia Post\nLittle-Known Pill To Fight Alcoholism Gets Its Time In The Sun\n2025-10-20\nAdExchanger\nTV’s Powerful Halo Effect: What It Is, How To Measure It And How You Can Harness It\n2025-10-10\nAdExchanger\nHow AI Helped Tatari Double Revenue Without Adding (or Losing) Staff\n2025-09-28\nCompany data provided by crunchbase Orion Your AI Copilot Quick Guide I see that you're asking about this Research Data Scientist role at Tatari. What would you like to know? Tell me why this job is a good fit for me.\nGive me some resume tips if I want to apply.\nGenerate custom resume tailored to this job.\nShow me Connections for potential referral.\nWrite a cover letter for this job. Welcome back, Nuthanreddy Vaddireddy!\nIt's great to see you again. Let's resume your journey towards your dream job.",
  "location": "Unknown",
  "posted_date": null,
  "source": "jobright",
  "posted_at": "1 hour ago",
  "apply_url": "https://jobright.ai/jobs/info/68561f2ddb9b2a749af54201",
  "id": "",
  "is_valid": true,
  "rejection_reason": null,
  "technical_skills": [],
  "soft_skills": [],
  "keywords": [],
  "resume_path": null,
  "cover_letter_path": null,
  "score": 0,
  "feedback": ""
}