{
  "url": "https://jobright.ai/jobs/info/693311b2a0dde7020e2ea3f7",
  "title": "Software Engineer, Frontend - Risk Platform",
  "company": "",
  "description": "Jobs\nResume\nProfile\nAgent\nTurbo for Students: Get Hired Faster!\nJOBS\nRecommended\nLiked\n0\nApplied\n172\nExternal\n1\n50 applicants\nAPPLY WITH AUTOFILL\nOverview\nCompany\nShare\nReport Issue\nOriginal Job Post\nCoinbase\n· 1 hour ago\nSoftware Engineer, Frontend - Risk Platform\nUnited States\nFull-time\nRemote\nEntry, Mid Level\n$152K/yr - $179K/yr\n2+ years exp\n53%\nFAIR MATCH\n100%\nExp. Level\n19%\nSkill\n77%\nIndustry Exp.\nMaximize your interview chances\nGenerate Custom Resume Coinbase is on a mission to increase economic freedom in the world and is seeking a Frontend Software Engineer for their Risk Platform team. The role involves shaping the architecture of the Risk Platform, collaborating with various teams to deliver seamless user experiences, and mentoring other team members. Bitcoin\nBlockchain\nCryptocurrency\nFinTech\nTrading Platform\nComp. & Benefits\nH1B Sponsor Likely\nInsider Connection @Coinbase\n5 email credits available today\nDiscover valuable connections within the company who might provide insights and potential referrals.\nGet 3x more responses when you reach out via email instead of LinkedIn.\nBeyond Your Network\nFind More Connections\nFrom Your Previous Company\nFind More Connections\nFrom Your School\nView\nT\nS\nTeja Dadi & 1 connections\n@Chaitanya Bharathi Institute Of Technology and...\nFind Any Email\nResponsibilities\nShape the next generation of Risk Platform architecture that powers Coinbase\nArticulate a long term technical direction and vision for maintaining and scaling our web and mobile platforms\nCreate trustworthy user experiences by building interfaces that are simple, easy to comprehend, performant and reliable using modern tools like React, React Native, Typescript, React Navigation, Jest and Webpack\nTurn our vision into a tangible roadmap every quarter by working with engineers, product managers and senior leadership\nMentor and train other team members on design techniques and coding standards\nAdd positive energy in every meeting, and make your coworkers feel included in every interaction\nQualification\nRepresents the skills you have Find out how your skills align with this job's requirements. If anything seems off, you can easily click on the tags to select or unselect skills to reflect your actual expertise. React\nJavaScript\nTypescript\nReact Native\nWeb performance\nMentoring\nCollaboration\nProblem-solving\nRequired\nYou have at least 2 years of experience in software engineering, developing web apps and shipping user-facing features with JavaScript and modern, component-based JS frameworks like React\nYou've developed and shipped user-facing features using component-based UI frameworks\nYou're familiar with current trends and best practices in front-end architecture, including performance, security and usability\nYou're familiar with product and design lifecycles, and collaborating closely with designers, engineers, and product managers\nYou write high quality, well tested code to meet the needs of your customers\nPreferred\nYou've worked on front-end teams in the finance or compliance space\nYou have at least 1 year of experience in developing React Native mobile apps or helped move existing native apps to React Native\nBenefits\nBonus eligibility\nEquity eligibility\nBenefits (including medical, dental, vision and 401(k))\nCompany\nCoinbase\nGlassdoor\n3.7\nCoinbase is a crypto exchange and wallet platform that allows merchants and consumers to buy, sell, and store digital currencies.\nFounded in 2012\nSan Francisco, California, USA\n1001-5000 employees\nhttps://www.coinbase.com\nH1B Sponsorship\nCoinbase has a track record of offering H1B sponsorships. Please note that this does not guarantee sponsorship for this specific role. Below presents additional info for your reference. (Data Powered by US Department of Labor)\nDistribution of Different Job Fields Receiving Sponsorship\nRepresents job field similar to this job\nTrends of Total Sponsorships\n2025 (181)\n2024 (92)\n2023 (96)\n2022 (284)\n2021 (183)\n2020 (66)\nFunding\nCurrent Stage\nPublic Company\nTotal Funding\n$4.45B\nKey Investors\nARK Investment Management\nTiger Global Management\nIVP\n2025-08-05\nPost Ipo Debt· $2.6B\n2025-03-04\nPost Ipo Equity· $8M\n2024-03-13\nPost Ipo Debt· $1.1B\nLeadership Team\nBrian Armstrong\nCEO & Co-Founder\nAlesia Haas\nCFO\nRecent News\nTradingView\nStablecoin yield fight threatens to sink CLARITY Act as Coinbase and White House clash\n2026-01-18\nTradingView\nCoinbase CEO denies White House clash, says negotiations are ongoing\n2026-01-18\nTradingView\nCoinbase CEO Says Banks Can 'Win Big' by Adopting Crypto Infrastructure\n2026-01-18\nCompany data provided by crunchbase Orion Your AI Copilot Quick Guide Welcome back, Nuthanreddy Vaddireddy!\nIt's great to see you again. Let's resume your journey towards your dream job. I see that you're asking about this Software Engineer, Frontend - Risk Platform role at Coinbase. What would you like to know? Tell me why this job is a good fit for me.\nGive me some resume tips if I want to apply.\nGenerate custom resume tailored to this job.\nShow me Connections for potential referral.\nWrite a cover letter for this job.",
  "location": "Unknown",
  "posted_date": null,
  "source": "jobright",
  "posted_at": "1 hour ago",
  "apply_url": "https://jobright.ai/jobs/info/693311b2a0dde7020e2ea3f7",
  "id": "",
  "is_valid": true,
  "rejection_reason": null,
  "technical_skills": [],
  "soft_skills": [],
  "keywords": [],
  "resume_path": null,
  "cover_letter_path": null,
  "score": 0,
  "feedback": ""
}