{
  "url": "https://jobright.ai/jobs/info/696d99535fc86241853c6aff",
  "title": "Research Scientist, Statistical Programming",
  "company": "",
  "description": "Jobs\nResume\nProfile\nAgent\nTurbo for Students: Get Hired Faster!\nJOBS\nRecommended\nLiked\n0\nApplied\n172\nExternal\n1\n59 applicants\nAPPLY WITH AUTOFILL\nOverview\nCompany\nShare\nReport Issue\nOriginal Job Post\nFlatiron Health\n· 1 hour ago\nResearch Scientist, Statistical Programming\nDurham office\nFull-time\nHybrid\nSenior Level, Lead/Staff\n3+ years exp\n76%\nGOOD MATCH\n42%\nExp. Level\n86%\nSkill\n67%\nIndustry Exp.\nMaximize your interview chances\nGenerate Custom Resume Flatiron Health is focused on reimagining the infrastructure of cancer care, fostering a community that values integrity and inspires growth. They are seeking a Lead Statistical Programmer who is proficient in R to support their mission of improving lives through real-world data analysis in cancer research. The role involves translating analytic specifications, mentoring junior staff, and collaborating with cross-functional teams to deliver client-sponsored research studies. Biotechnology\nCloud Computing\nElectronic Health Record (EHR)\nHealth Care\nHealth Diagnostics\nHospital\nPersonal Health\nWork & Life Balance\nH1B Sponsor Likely\nInsider Connection @Flatiron Health\n5 email credits available today\nDiscover valuable connections within the company who might provide insights and potential referrals.\nGet 3x more responses when you reach out via email instead of LinkedIn.\nBeyond Your Network\nView\nJ\nA\nQ\nM\nR\nJia Wen & 4 connections\nFrom Your Previous Company\nFind More Connections\nFrom Your School\nView\nM\nMarie Polito RN, BSN\nOncology Abstractor\n@The University of Texas at Arlington\nFind Any Email\nResponsibilities\nIndependently translate analytic specifications from a statistical analysis plan into R code to create analytic datasets, generating descriptive and inferential statistics, data visualizations, often involving novel variables or complex statistical methods, in consultation with the study principal investigator\nServe as subject matter expert on appropriate use cases for, and nuances of, the variety of different Flatiron data modalities, including EHR-derived real-world data, clinico-genomics data, ML-extracted data, and claims data\nDevelop a proficient understanding of cancer biology, therapy, and/or epidemiology across multiple major tumor types and appropriately apply this understanding when crafting analytic code\nProvide mentorship and support to more junior statistical programming staff\nCollaborate with cross-functional stakeholders across our medical and scientific organization to execute and deliver on client-sponsored research studies in an accurate, effective, and timely manner\nContribute to continuous improvement of Flatiron’s proprietary analytical tooling and templates, at times acting as liaison to the relevant teams and stakeholders\nContinue to develop a deeper understanding of real-world data and related methodologies used to generate real-world evidence\nQualification\nRepresents the skills you have Find out how your skills align with this job's requirements. If anything seems off, you can easily click on the tags to select or unselect skills to reflect your actual expertise. R programming\nStatistical analysis\nReal-world data analysis\nGit proficiency\nHealthcare datasets experience\nOncology datasets experience\nPredictive modeling\nSQL queries\nTeam leadership\nOrganizational skills\nCommunication skills\nProblem-solving\nRequired\nYou hold a Doctorate degree (e.g., PhD, ScD, DrPH) in Biostatistics/Statistics, Data Science, Bioinformatics, Biological Sciences, Public Health, Math, or a closely related field with 3-4 years of relevant experience, or a Master's degree with 6-7 years of relevant experience or a Bachelor's degree with 7-8 years of relevant experience\nYou are an excellent programmer in R (including tidyverse) and are proficient working in Git-based environments (e.g., Github, Gitlab)\nYou have extensive experience with large healthcare-related datasets (e.g., administrative claims, electronic medical records, genomics)\nYou have strong organizational, time-management, prioritization and decision-making skills necessary to evaluate, plan and implement multiple high-visibility projects in a timely fashion\nYou have the ability to lead projects effectively in a constantly changing, diverse, and matrix environment\nYou have a growth mindset, are willing to learn from others, and are dedicated to promoting a psychologically safe environment\nPreferred\nYou have experience working with oncology datasets\nYou can write SQL queries\nYou have experience in predictive modeling\nYou have experience leading teams, either as a manager or project/team lead\nCompany\nFlatiron Health\nGlassdoor\n3.7\nFlatiron Health is a healthcare technology company that aims to improve lives by learning from the experience of every cancer patient.\nFounded in 2012\nNew York, New York, USA\n1001-5000 employees\nhttps://flatiron.com\nH1B Sponsorship\nFlatiron Health has a track record of offering H1B sponsorships. Please note that this does not guarantee sponsorship for this specific role. Below presents additional info for your reference. (Data Powered by US Department of Labor)\nDistribution of Different Job Fields Receiving Sponsorship\nRepresents job field similar to this job\nTrends of Total Sponsorships\n2025 (17)\n2024 (28)\n2023 (16)\n2022 (27)\n2021 (29)\n2020 (33)\nFunding\nCurrent Stage\nLate Stage\nTotal Funding\n$324.95M\nKey Investors\nRoche\nGoogle Ventures\n2021-12-23\nSeries D· $11.95M\n2018-02-15\nAcquired\n2016-01-06\nSeries C· $175M\nLeadership Team\nStephanie Reisinger\nSenior Vice President and General Manager, Real-World Evidence (RWE)\nJacqueline Law\nVice President, Corporate Development\nRecent News\nMobihealthnews\nParadigm Health raises $78M, acquires Flatiron Health's Clinical Research Business\n2025-12-09\nGenomeWeb\nParadigm Health Acquires Flatiron Health's Clinical Research Business\n2025-12-06\nPR Newswire\nParadigm Health Acquires Flatiron Health's Clinical Research Business and Forms Strategic Partnership to Rebuild Clinical Research Ecosystem\n2025-12-05\nCompany data provided by crunchbase Orion Your AI Copilot Quick Guide Welcome back, Nuthanreddy Vaddireddy!\nIt's great to see you again. Let's resume your journey towards your dream job. I see that you're asking about this Research Scientist, Statistical Programming role at Flatiron Health. What would you like to know? Tell me why this job is a good fit for me.\nGive me some resume tips if I want to apply.\nGenerate custom resume tailored to this job.\nShow me Connections for potential referral.\nWrite a cover letter for this job.",
  "location": "Unknown",
  "posted_date": null,
  "source": "jobright",
  "posted_at": "1 hour ago",
  "apply_url": "https://jobright.ai/jobs/info/696d99535fc86241853c6aff",
  "id": "",
  "is_valid": true,
  "rejection_reason": null,
  "technical_skills": [],
  "soft_skills": [],
  "keywords": [],
  "resume_path": null,
  "cover_letter_path": null,
  "score": 0,
  "feedback": ""
}