{
  "url": "https://jobright.ai/jobs/info/696d9962350cf4380314684e",
  "title": "Senior Data Scientist, Global Search",
  "company": "",
  "description": "Jobs\nResume\nProfile\nAgent\nTurbo for Students: Get Hired Faster!\nJOBS\nRecommended\nLiked\n0\nApplied\n172\nExternal\n1\nBe an early applicant\nLess than 25 applicants\nAPPLY NOW\nOverview\nCompany\nShare\nReport Issue\nOriginal Job Post\nTikTok\n· 1 hour ago\nSenior Data Scientist, Global Search\nSan Jose, CA\nFull-time\nOnsite\nSenior Level\n$176K/yr - $395K/yr\n84%\nGOOD MATCH\n61%\nExp. Level\n98%\nSkill\n74%\nIndustry Exp.\nMaximize your interview chances\nGenerate Custom Resume TikTok is the leading destination for short-form mobile video, and they are seeking a Senior Data Scientist for their Global Product & RD team. The role involves leading data analysis to enhance user search experiences and collaborating with various teams to implement actionable optimization solutions. Content Creators\nContent Discovery\nMedia and Entertainment\nSocial Media\nVideo\nH1B Sponsor Likely\nInsider Connection @TikTok\n5 email credits available today\nDiscover valuable connections within the company who might provide insights and potential referrals.\nGet 3x more responses when you reach out via email instead of LinkedIn.\nBeyond Your Network\nView\nC\nX\nG\nC\nJ\nChloe (Xiaoyu) Wu & 4 connections\nFrom Your Previous Company\nFind More Connections\nFrom Your School\nView\nX\nC\nY\nH\nS\nXin Miao & 4 connections\n@The University of Texas at Arlington and...\nFind Any Email\nResponsibilities\nResponsible for data analysis work related to international product search business\nLead a team in conducting in-depth analysis within the business domain. Identify optimization points that can enhance the user search experience across various products based on business logic. Provide clear and actionable optimization solutions, and collaborate with product, operations, algorithm, and development teams to implement these solutions, resulting in actual business growth\nLead the team in designing and analyzing various A/B experiments within the search business, evaluating product optimization outcomes, assessing market activity impact, analyzing fluctuations in key metrics, and establishing data systems\nStay informed about industry trends and gain insights into the search business. Offer directional analysis guidance to the search business, participate in critical business decisions, and provide solutions to key and challenging issues within the search business\nResponsible for building specialized models to support the business\nQualification\nRepresents the skills you have Find out how your skills align with this job's requirements. If anything seems off, you can easily click on the tags to select or unselect skills to reflect your actual expertise. SQL\nMachine Learning\nData Analysis\nPython\nR\nCuriosity\nTeam Management\nCommunication Skills\nLearning Ability\nRequired\nBachelor's degree or higher, with a preference for majors in mathematics, statistics, or computer-related fields\nData-sensitive with the ability to quickly grasp business concepts, uncover business details, and establish connections between data\nProficient in SQL, with experience in R, Python, or other scripting languages\nPossess machine learning capabilities, including regression, classification, and clustering\nPreferred\nExperience in internet data analysis is a plus\nPrior experience in search business and team management is a plus\nStrong communication and teamwork skills\nStrong learning ability and curiosity\nKeen interest in the internet industry with a desire for long-term development within the field\nBenefits\nMedical, dental, and vision insurance\nA 401(k) savings plan with company match\nPaid parental leave\nShort-term and long-term disability coverage\nLife insurance\nWellbeing benefits\n10 paid holidays per year\n10 paid sick days per year\n17 days of Paid Personal Time (prorated upon hire with increasing accruals by tenure)\nCompany\nTikTok\nGlassdoor\n3.4\nTikTok is a short-form video entertainment app and social network platform. It is a sub-organization of ByteDance.\nFounded in 2003\nLos Angeles, California, USA\n10001+ employees\nhttps://www.tiktok.com\nH1B Sponsorship\nTikTok has a track record of offering H1B sponsorships. Please note that this does not guarantee sponsorship for this specific role. Below presents additional info for your reference. (Data Powered by US Department of Labor)\nDistribution of Different Job Fields Receiving Sponsorship\nRepresents job field similar to this job\nTrends of Total Sponsorships\n2025 (979)\n2024 (601)\n2023 (387)\n2022 (322)\n2021 (133)\n2020 (72)\nFunding\nCurrent Stage\nLate Stage\nLeadership Team\nN Ali Mohamed\nCEO\nBlake Chandlee\nVP Global Business Solutions\nRecent News\nRTE Online\nTikTok to tighten age checks in Europe\n2026-01-17\nSocial Media Today\nTikTok Adds More AI-Powered Tools To Assist TikTok Shop Merchants\n2026-01-17\nSports Business Journal\nSports Media Pod: How MLB is utilizing TikTok\n2026-01-17\nCompany data provided by crunchbase Orion Your AI Copilot Quick Guide Welcome back, Nuthanreddy Vaddireddy!\nIt's great to see you again. Let's resume your journey towards your dream job. I see that you're asking about this Senior Data Scientist, Global Search role at TikTok. What would you like to know? Tell me why this job is a good fit for me.\nGive me some resume tips if I want to apply.\nGenerate custom resume tailored to this job.\nShow me Connections for potential referral.\nWrite a cover letter for this job.",
  "location": "Unknown",
  "posted_date": null,
  "source": "jobright",
  "posted_at": "1 hour ago",
  "apply_url": "https://jobright.ai/jobs/info/696d9962350cf4380314684e",
  "id": "",
  "is_valid": true,
  "rejection_reason": null,
  "technical_skills": [],
  "soft_skills": [],
  "keywords": [],
  "resume_path": null,
  "cover_letter_path": null,
  "score": 0,
  "feedback": ""
}